# SQL en Python
<img src=".\img\image-4.png" alt="EDA Path"
    title="A typical EDA path" width="600" height="300" />
## Conectamos con la base de datos

### Documentación de la librería SQLite3 que vamos a utilizar:
https://docs.python.org/3/library/sqlite3.html

In [1]:
import pymysql

In [21]:
# Importamos librerias
import pandas as pd 
import sqlite3

In [22]:
# Conectamos con la base de datos chinook.db
path = "chinook.db"
connection = sqlite3.connect(path)

# Obtenemos un cursor que utilizaremos para hacer las queries
curs = connection.cursor()

In [23]:
curs.description

In [24]:
# Creamos una Query sencilla
query = """
SELECT *
FROM genres
"""

In [25]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
my_query = curs.execute(query)
my_query

In [26]:
# Para visualizarlo
my_query.fetchall()

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [27]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    curs.execute(query)

    datos_query = curs.fetchall()

    col_names = [description[0] for description in curs.description]

    return pd.DataFrame(datos_query, columns=col_names)

In [28]:
sql_query(query)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

In [29]:
# Tambien podemos obtener el mismo resultado directamente con pandas
# query = """
# SELECT *
# FROM genres
# """



pd.read_sql_query(query, connection)  # Esta función directamente te lo ejecuta y te lo muestra

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

## Ya podemos comenzar con la práctica de chinook:
Antes de empezar a atacar una base de datos, tendremos que saber qué hay dentro, y para ello lo mejor es ver cómo es su **modelo de datos**

![imagen](./img/chinook_data_model.png)

### 1.	Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

In [30]:
path = "chinook.db"
connection = sqlite3.connect(path)

In [31]:
query = """
SELECT * 
FROM customers, invoices
WHERE customers.CustomerId = invoices.CustomerId
"""
# Donde no haya equivalencia entre CustomerId de customers y invoices, no nos va a dar el output
pd.read_sql_query(query, connection)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,...,SupportRepId,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,...,3,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
407,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,45,59,2009-07-08 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,5.94
408,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,97,59,2010-02-26 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.99
409,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,218,59,2011-08-20 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,1.98
410,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,229,59,2011-09-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,13.86
411,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,...,3,284,59,2012-05-30 00:00:00,"3,Raj Bhavan Road",Bangalore,None,India,560001,8.91

In [32]:
query = """
SELECT c.Firstname||" "||c.Lastname as FullName, i.invoiceid, i.invoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country == "Brazil"
"""
pd.read_sql_query(query, connection)

           FullName  InvoiceId          InvoiceDate BillingCountry
0    Luís Gonçalves         98  2010-03-11 00:00:00         Brazil
1    Luís Gonçalves        121  2010-06-13 00:00:00         Brazil
2    Luís Gonçalves        143  2010-09-15 00:00:00         Brazil
3    Luís Gonçalves        195  2011-05-06 00:00:00         Brazil
4    Luís Gonçalves        316  2012-10-27 00:00:00         Brazil
5    Luís Gonçalves        327  2012-12-07 00:00:00         Brazil
6    Luís Gonçalves        382  2013-08-07 00:00:00         Brazil
7   Eduardo Martins         25  2009-04-09 00:00:00         Brazil
8   Eduardo Martins        154  2010-11-14 00:00:00         Brazil
9   Eduardo Martins        177  2011-02-16 00:00:00         Brazil
10  Eduardo Martins        199  2011-05-21 00:00:00         Brazil
11  Eduardo Martins        251  2012-01-09 00:00:00         Brazil
12  Eduardo Martins        372  2013-07-02 00:00:00         Brazil
13  Eduardo Martins        383  2013-08-12 00:00:00         Brazil
14  Alexandre Rocha         57  2009-09-06 00:00:00         Brazil
15  Alexandre Rocha         68  2009-10-17 00:00:00         Brazil
16  Alexandre Rocha        123  2010-06-17 00:00:00         Brazil
17  Alexandre Rocha        252  2012-01-22 00:00:00         Brazil
18  Alexandre Rocha        275  2012-04-25 00:00:00         Brazil
19  Alexandre Rocha        297  2012-07-28 00:00:00         Brazil
20  Alexandre Rocha        349  2013-03-18 00:00:00         Brazil
21  Roberto Almeida         34  2009-05-23 00:00:00         Brazil
22  Roberto Almeida        155  2010-11-14 00:00:00         Brazil
23  Roberto Almeida        166  2010-12-25 00:00:00         Brazil
24  Roberto Almeida        221  2011-08-25 00:00:00         Brazil
25  Roberto Almeida        350  2013-03-31 00:00:00         Brazil
26  Roberto Almeida        373  2013-07-03 00:00:00         Brazil
27  Roberto Almeida        395  2013-10-05 00:00:00         Brazil
28   Fernanda Ramos         35  2009-06-05 00:00:00         Brazil
29   Fernanda Ramos         58  2009-09-07 00:00:00         Brazil
30   Fernanda Ramos         80  2009-12-10 00:00:00         Brazil
31   Fernanda Ramos        132  2010-07-31 00:00:00         Brazil
32   Fernanda Ramos        253  2012-01-22 00:00:00         Brazil
33   Fernanda Ramos        264  2012-03-03 00:00:00         Brazil
34   Fernanda Ramos        319  2012-11-01 00:00:00         Brazil

### 2.	Facturas de Clientes de Brasil

In [33]:
query = """
SELECT i.*
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country == "Brazil"
"""
pd.read_sql_query(query, connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
5,327,1,2012-12-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,13.86
6,382,1,2013-08-07 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,8.91
7,25,10,2009-04-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,8.91
8,154,10,2010-11-14 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
9,177,10,2011-02-16 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,3.96
10,199,10,2011-05-21 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,5.94
11,251,10,2012-01-09 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,0.99
12,372,10,2013-07-02 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,1.98
13,383,10,2013-08-12 00:00:00,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,13.86
14,57,11,2009-09-06 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
15,68,11,2009-10-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,13.86
16,123,11,2010-06-17 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,8.91
17,252,11,2012-01-22 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,1.98
18,275,11,2012-04-25 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,3.96
19,297,11,2012-07-28 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,5.94
20,349,11,2013-03-18 00:00:00,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,0.99
21,34,12,2009-05-23 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,0.99
22,155,12,2010-11-14 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
23,166,12,2010-12-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,13.86
24,221,12,2011-08-25 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,8.91
25,350,12,2013-03-31 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,1.98
26,373,12,2013-07-03 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,3.96
27,395,12,2013-10-05 00:00:00,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,5.94
28,35,13,2009-06-05 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
29,58,13,2009-09-07 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,3.96
30,80,13,2009-12-10 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,5.94
31,132,13,2010-07-31 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,0.99
32,253,13,2012-01-22 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,1.98
33,264,13,2012-03-03 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,13.86
34,319,13,2012-11-01 00:00:00,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,8.91

### 3.	Muestra cada factura asociada a cada agente de ventas con su nombre completo.

In [34]:
query = """ 
SELECT e.Firstname||" "||e.Lastname as FullName, i.*
FROM employees e
JOIN customers c, invoices i ON e.EmployeeId = c.SupportRepId AND c.CustomerId = i.CustomerId
"""
# SINONIMO DE:
# JOIN customers c ON e.EmployeeId = c.SupportRepId
# JOIN invoices i ON c.CustomerId = i.CustomerId

pd.read_sql_query(query, connection)

,FullName,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,Jane Peacock,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,Jane Peacock,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,Jane Peacock,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,Jane Peacock,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,Jane Peacock,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98
...,...,...,...,...,...,...,...,...,...,...
407,Steve Johnson,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91
408,Steve Johnson,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98
409,Steve Johnson,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96
410,Steve Johnson,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94
411,Steve Johnson,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99

### 4.	Para cada factura muestra el nombre del cliente, el país, el nombre del agente y el total

In [35]:
query = """ 
SELECT c.Firstname||" "||c.Lastname as FullNameCustomer, c.Country, e.Firstname||" "||e.Lastname as FullNameAgent, i.Total
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
"""
pd.read_sql_query(query, connection)

    FullNameCustomer Country FullNameAgent  Total
0     Luís Gonçalves  Brazil  Jane Peacock   3.98
1     Luís Gonçalves  Brazil  Jane Peacock   3.96
2     Luís Gonçalves  Brazil  Jane Peacock   5.94
3     Luís Gonçalves  Brazil  Jane Peacock   0.99
4     Luís Gonçalves  Brazil  Jane Peacock   1.98
..               ...     ...           ...    ...
407  Puja Srivastava   India  Jane Peacock   5.94
408  Puja Srivastava   India  Jane Peacock   1.99
409  Puja Srivastava   India  Jane Peacock   1.98
410  Puja Srivastava   India  Jane Peacock  13.86
411  Puja Srivastava   India  Jane Peacock   8.91

[412 rows x 4 columns]

### 5.	Muestra cada artículo de la factura con el nombre de la canción.

In [36]:
query = """
SELECT it.InvoiceId, t.Name
FROM tracks t
JOIN invoice_items it ON t.TrackId = it.TrackId
"""

pd.read_sql_query(query, connection)

      InvoiceId                                               Name
0             1                                  Balls to the Wall
1             1                                  Restless and Wild
2             2                              Put The Finger On You
3             2                                   Inject The Venom
4             2                                         Evil Walks
...         ...                                                ...
2235        411                                   Looking For Love
2236        411                                    Sweet Lady Luck
2237        411  Feirinha da Pavuna/Luz do Repente/Bagaço da La...
2238        411                                   Samba pras moças
2239        412                                           Hot Girl

[2240 rows x 2 columns]

### 6.	Muestra todas las canciones con su nombre, formato, álbum y género.

In [37]:
query = """
SELECT t.Name as "Song Name" , mt.Name as "Format", a.Title as "Album", g.Name as "Genre"
FROM tracks t
JOIN genres g ON t.GenreId = g.GenreId 
JOIN media_types mt ON t.MediaTypeId = mt.MediaTypeId
JOIN albums a ON t.AlbumId = a.AlbumId
"""

pd.read_sql_query(query, connection)

,Song Name,Format,Album,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

### 7.	Muestra cuántas canciones hay en cada playlist y el nombre de cada playlist.

In [39]:
query = """
SELECT p.Name as "Playlist", COUNT(*) as "Nº" 
--también puedes poner COUNT(pt.PlaylistId) para que sea más visual--
FROM playlist_track pt 
JOIN playlistS p ON Pt.PlaylistId = p.PlaylistId
GROUP BY pt.PlaylistId
"""


pd.read_sql_query(query, connection)

                      Playlist    Nº
0                        Music  3290
1                     TV Shows   213
2                   90’s Music  1477
3                        Music  3290
4                 Music Videos     1
5                     TV Shows   213
6              Brazilian Music    39
7                    Classical    75
8    Classical 101 - Deep Cuts    25
9   Classical 101 - Next Steps    25
10  Classical 101 - The Basics    25
11                      Grunge    15
12         Heavy Metal Classic    26
13                 On-The-Go 1     1

In [19]:
#Aquí al agrupar por nombre no estamos teniendo en cuenta el Id, que es lo que asegura que sean diferentes
query = """
SELECT p.Name as "Playlist", COUNT(*) as "Nº"
FROM playlist_track pt 
JOIN playlistS p ON Pt.PlaylistId = p.PlaylistId
GROUP BY p.Name
"""

pd.read_sql_query(query, connection)

                      Playlist    Nº
0                   90’s Music  1477
1              Brazilian Music    39
2                    Classical    75
3    Classical 101 - Deep Cuts    25
4   Classical 101 - Next Steps    25
5   Classical 101 - The Basics    25
6                       Grunge    15
7          Heavy Metal Classic    26
8                        Music  6580
9                 Music Videos     1
10                 On-The-Go 1     1
11                    TV Shows   426

### 8.	Muestra cuánto ha vendido cada empleado.

In [43]:
query = """
SELECT e.LastName||""||e.FirstName as FullName, SUM(Quantity)
FROM employees e 
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId 
JOIN invoice_items it ON i.InvoiceId = it.InvoiceId
GROUP BY e.EmployeeId
"""

pd.read_sql_query(query, connection)

       FullName  SUM(Quantity)
0   PeacockJane            796
1  ParkMargaret            760
2  JohnsonSteve            684

In [45]:
query = """
SELECT LastName||""||FirstName as FullName, EmployeeId
FROM employees 
GROUP BY EmployeeId
"""

pd.read_sql_query(query, connection)

          FullName  EmployeeId
0      AdamsAndrew           1
1     EdwardsNancy           2
2      PeacockJane           3
3     ParkMargaret           4
4     JohnsonSteve           5
5  MitchellMichael           6
6       KingRobert           7
7    CallahanLaura           8

### 9.	¿Quién ha sido el agente de ventas que más ha vendido en 2009?

In [49]:
query = """
SELECT e.LastName||""||e.FirstName as FullName, SUM(Total) as "Sales"
FROM employees e 
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId 

WHERE i.InvoiceDate LIKE "2009%"
GROUP BY e.EmployeeId
ORDER BY Sales DESC
LIMIT 1
"""
pd.read_sql_query(query, connection)

       FullName   Sales
0  JohnsonSteve  164.34

### 10.	¿Cuáles son los 3 grupos que más han vendido?

In [55]:
query = """
SELECT t.Composer, SUM(Quantity) as "Sales"
FROM tracks t 
JOIN invoice_items it ON t.TrackId = it.TrackId

GROUP BY t.Composer
ORDER BY Sales DESC
LIMIT 3
"""
pd.read_sql_query(query, connection)

       Composer  Sales
0          None    596
1  Steve Harris     58
2            U2     33

In [53]:
query = """
SELECT t.Composer
FROM tracks t 

"""
pd.read_sql_query(query, connection)

                                               Composer
0             Angus Young, Malcolm Young, Brian Johnson
1                                                  None
2     F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...
3     F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...
4                            Deaffy & R.A. Smith-Diesel
...                                                 ...
3498                                               None
3499                                     Franz Schubert
3500                                 Claudio Monteverdi
3501                            Wolfgang Amadeus Mozart
3502                                       Philip Glass

[3503 rows x 1 columns]

### 11. Muestra cuántas canciones de Rock hay en cada playlist

In [72]:
query = """
SELECT g.Name,p.Name,COUNT(t.Name)
FROM genres g
JOIN tracks t ON g.GenreId = t.GenreId
JOIN playlist_track pt ON t.TrackId = pt.TrackId
JOIN playlists p ON pt.PlaylistId = p.PlaylistId
WHERE g.Name = "Rock"
GROUP BY p.PlaylistId

"""
pd.read_sql_query(query, connection)

   Name                 Name  COUNT(t.Name)
0  Rock                Music           1297
1  Rock           90’s Music            621
2  Rock                Music           1297
3  Rock               Grunge             14
4  Rock  Heavy Metal Classic              9

### 12. Muestra una tabla con todas canciones y su(s) Id de factura, hayan sido vendidas alguna vez o no.

In [75]:
query = """
SELECT t.Name as "song", it.InvoiceId 
FROM tracks t
LEFT JOIN invoice_items it ON t.TrackId = it.TrackId

"""
pd.read_sql_query(query, connection)

                                                   song  InvoiceId
0               For Those About To Rock (We Salute You)      108.0
1                                     Balls to the Wall        1.0
2                                     Balls to the Wall      214.0
3                                       Fast As a Shark      319.0
4                                     Restless and Wild        1.0
...                                                 ...        ...
3754  String Quartet No. 12 in C Minor, D. 703 "Quar...      108.0
3755  String Quartet No. 12 in C Minor, D. 703 "Quar...      319.0
3756               L'orfeo, Act 3, Sinfonia (Orchestra)        NaN
3757  Quintet for Horn, Violin, 2 Violas, and Cello ...        NaN
3758                                      Koyaanisqatsi        NaN

[3759 rows x 2 columns]

### 13. ¿Cuántos artistas no tienen ningún album?

In [74]:
query = """
SELECT COUNT(*) "Artists without Album"
FROM artists a
LEFT JOIN albums b ON a.ArtistId = b.ArtistId
WHERE Title IS NULL
"""
# con NULL no podemos ponerlo con =, ponemos IS, si fuese otro valor, se puede poner con =
pd.read_sql_query(query, connection)

   Artists without Album
0                     71